INFO_DATA: dict[str, dict[str, str]] = {
    "1": {
        "q": "Что представляет собой конкурс «Turan-Innovations»?",
        "a": "«Turan-Innovations» — это молодежный конкурс бизнес-проектов, организуемый университетом «Туран» с целью"
             " поддержки предпринимательских инициатив и инновационных идей молодежи. "
    },
    "2": {
        "q": "Какова основная цель конкурса «Turan-Innovations»?",
        "a": "Основная цель конкурса — повышение предпринимательской активности и вовлечение молодежи в "
             "предпринимательскую среду"
    },
    "3": {
        "q": "Кто осуществляет общую координацию проведения конкурса?",
        "a": "Общую координацию конкурса осуществляет проректор по стратегическому развитию, науке и инновациям."
    },
    "4": {
        "q": "За счет каких источников финансируется конкурс?",
        "a": "Финансирование конкурса осуществляется за счет университета и/или средств инвесторов."
    },
    "5": {
        "q": "Какие задачи ставит конкурс «Turan-Innovations»?",
        "a": "Конкурс направлен на развитие предпринимательской активности, поддержку молодежных инициатив и повышение"
             " профессиональных навыков в сфере бизнеса. "
    }
}

PARTICIPATION_DATA: dict[str, dict[str, str]] = {
    "1": {
        "q": "Кто может принимать участие в конкурсе?",
        "a": "В конкурсе могут участвовать студенты, магистранты, докторанты и преподаватели в возрасте до 35 лет."
    },
    "2": {
        "q": "Сколько человек может входить в команду?",
        "a": " В составе авторской группы может быть не более 5 человек. "
    },
    "3": {
        "q": "Могут ли преподаватели быть менторами проекта?",
        "a": "Да, любой преподаватель может выступать ментором или консультантом проекта независимо от возраста."
    }
}

RULES_DATA: dict[str, dict[str, str]] = {
    "1": {
        "q": "Какие проекты допускаются к участию в конкурсе?",
        "a": "К участию допускаются самостоятельно выполненные законченные бизнес-проекты: социальные, коммерческие,"
             " творческие и другие. "
    },
    "2": {
        "q": "На каких языках можно подать материалы на конкурс?",
        "a": "Материалы принимаются на государственном и/или русском языках. "
    },
    "3": {
        "q": "В каком формате необходимо предоставлять материалы?",
        "a": "Материалы подаются как в бумажном, так и в электронном виде"
    },
    "4": {
        "q": "Что должно быть включено в структуру бизнес-проекта?",
        "a": "Проект должен содержать описание идеи, анализ рисков, маркетинговый план, информацию о реализации,"
             " рентабельности и ожидаемых результатах."
    }
}

CRITERIA_DATA: dict[str, dict[str, str]] = {
    "1": {
        "q": "Сколько этапов включает конкурс?",
        "a": "Конкурс включает в себя два этапа: предварительный и итоговый. "
    },
    "2": {
        "q": "Какие критерии оцениваются на первом этапе?",
        "a": "На первом этапе оцениваются полнота описания проекта, инновационность, реалистичность, оригинальность,"
             " конкретность механизмов реализации, эффективность и перспективность проекта. "
    },
    "3": {
        "q": "Что происходит с проектами, набравшими макс. количество баллов на первом этапе?",
        "a": "Проекты, набравшие наибольшее количество баллов, проходят во второй этап конкурса. "
    },
    "4": {
        "q": "Что необходимо для участия во втором этапе конкурса?",
        "a": "Участники должны представить устный доклад с презентацией проекта продолжительностью не более 5 минут."
    },
    "5": {
        "q": "Какие преимущества проекта ценятся на втором этапе?",
        "a": "Особенно ценятся актуальность, социальная значимость, возможность коммерциализации, инновационность,"
             " качество презентации и прибыльность проекта."
    },
    "6": {
        "q": "Кто входит в состав конкурсной комиссии?",
        "a": " В состав комиссии входят представители университета, предприниматели, партнеры университета,"
             " представители бизнес-структур и общественных организаций. "
    },
    "7": {
        "q": "Имеет ли право секретарь конкурсной комиссии оценивать проекты?",
        "a": "Нет, секретарь конкурсной комиссии не имеет права оценивать проекты участников."
    }
}

COMMANDS: dict[str, str] = {
    "start": "Запуск бота",
    "help": "Помощь"
}

HANDLERS: list[str] = [
    "О конкурсе",
    "Кто может участвовать",
    "Правила и подача",
    "Этапы и критерии"
]
